susanw1/zscript/receivers/native/arm/implementations/src/main/c++/stm32/AlternateFunction/STM32F410.h
/*
 * This file is automatically generated by afTable.py from the xml descriptions provided as part of the STM32Cube IDE
 * Timestamp: 2022-12-19T23:52:16.993169
 */

#ifndef LOWLEVEL_INCLUDE_DEVICE_ALTERNATE_FUNCTION
#define LOWLEVEL_INCLUDE_DEVICE_ALTERNATE_FUNCTION

#define EVENTOUT_PA0_ PA0,GPIO_AF15
#define EVENTOUT_PA1_ PA1,GPIO_AF15
#define EVENTOUT_PA10_ PA10,GPIO_AF15
#define EVENTOUT_PA11_ PA11,GPIO_AF15
#define EVENTOUT_PA12_ PA12,GPIO_AF15
#define EVENTOUT_PA13_ PA13,GPIO_AF15
#define EVENTOUT_PA14_ PA14,GPIO_AF15
#define EVENTOUT_PA15_ PA15,GPIO_AF15
#define EVENTOUT_PA2_ PA2,GPIO_AF15
#define EVENTOUT_PA3_ PA3,GPIO_AF15
#define EVENTOUT_PA4_ PA4,GPIO_AF15
#define EVENTOUT_PA5_ PA5,GPIO_AF15
#define EVENTOUT_PA6_ PA6,GPIO_AF15
#define EVENTOUT_PA7_ PA7,GPIO_AF15
#define EVENTOUT_PA8_ PA8,GPIO_AF15
#define EVENTOUT_PA9_ PA9,GPIO_AF15
#define EVENTOUT_PB0_ PB0,GPIO_AF15
#define EVENTOUT_PB1_ PB1,GPIO_AF15
#define EVENTOUT_PB10_ PB10,GPIO_AF15
#define EVENTOUT_PB11_ PB11,GPIO_AF15
#define EVENTOUT_PB12_ PB12,GPIO_AF15
#define EVENTOUT_PB13_ PB13,GPIO_AF15
#define EVENTOUT_PB14_ PB14,GPIO_AF15
#define EVENTOUT_PB15_ PB15,GPIO_AF15
#define EVENTOUT_PB2_ PB2,GPIO_AF15
#define EVENTOUT_PB3_ PB3,GPIO_AF15
#define EVENTOUT_PB4_ PB4,GPIO_AF15
#define EVENTOUT_PB5_ PB5,GPIO_AF15
#define EVENTOUT_PB6_ PB6,GPIO_AF15
#define EVENTOUT_PB7_ PB7,GPIO_AF15
#define EVENTOUT_PB8_ PB8,GPIO_AF15
#define EVENTOUT_PB9_ PB9,GPIO_AF15
#define EVENTOUT_PC0_ PC0,GPIO_AF15
#define EVENTOUT_PC1_ PC1,GPIO_AF15
#define EVENTOUT_PC10_ PC10,GPIO_AF15
#define EVENTOUT_PC11_ PC11,GPIO_AF15
#define EVENTOUT_PC12_ PC12,GPIO_AF15
#define EVENTOUT_PC13_ PC13,GPIO_AF15
#define EVENTOUT_PC14_ PC14,GPIO_AF15
#define EVENTOUT_PC15_ PC15,GPIO_AF15
#define EVENTOUT_PC2_ PC2,GPIO_AF15
#define EVENTOUT_PC3_ PC3,GPIO_AF15
#define EVENTOUT_PC4_ PC4,GPIO_AF15
#define EVENTOUT_PC5_ PC5,GPIO_AF15
#define EVENTOUT_PC6_ PC6,GPIO_AF15
#define EVENTOUT_PC7_ PC7,GPIO_AF15
#define EVENTOUT_PC8_ PC8,GPIO_AF15
#define EVENTOUT_PC9_ PC9,GPIO_AF15
#define EVENTOUT_PH0 _ PH0 ,GPIO_AF15
#define EVENTOUT_PH1 _ PH1 ,GPIO_AF15
#define _EVENTOUT_PA0_ 1
#define _EVENTOUT_PA1_ 1
#define _EVENTOUT_PA10_ 1
#define _EVENTOUT_PA11_ 1
#define _EVENTOUT_PA12_ 1
#define _EVENTOUT_PA13_ 1
#define _EVENTOUT_PA14_ 1
#define _EVENTOUT_PA15_ 1
#define _EVENTOUT_PA2_ 1
#define _EVENTOUT_PA3_ 1
#define _EVENTOUT_PA4_ 1
#define _EVENTOUT_PA5_ 1
#define _EVENTOUT_PA6_ 1
#define _EVENTOUT_PA7_ 1
#define _EVENTOUT_PA8_ 1
#define _EVENTOUT_PA9_ 1
#define _EVENTOUT_PB0_ 1
#define _EVENTOUT_PB1_ 1
#define _EVENTOUT_PB10_ 1
#define _EVENTOUT_PB11_ 1
#define _EVENTOUT_PB12_ 1
#define _EVENTOUT_PB13_ 1
#define _EVENTOUT_PB14_ 1
#define _EVENTOUT_PB15_ 1
#define _EVENTOUT_PB2_ 1
#define _EVENTOUT_PB3_ 1
#define _EVENTOUT_PB4_ 1
#define _EVENTOUT_PB5_ 1
#define _EVENTOUT_PB6_ 1
#define _EVENTOUT_PB7_ 1
#define _EVENTOUT_PB8_ 1
#define _EVENTOUT_PB9_ 1
#define _EVENTOUT_PC0_ 1
#define _EVENTOUT_PC1_ 1
#define _EVENTOUT_PC10_ 1
#define _EVENTOUT_PC11_ 1
#define _EVENTOUT_PC12_ 1
#define _EVENTOUT_PC13_ 1
#define _EVENTOUT_PC14_ 1
#define _EVENTOUT_PC15_ 1
#define _EVENTOUT_PC2_ 1
#define _EVENTOUT_PC3_ 1
#define _EVENTOUT_PC4_ 1
#define _EVENTOUT_PC5_ 1
#define _EVENTOUT_PC6_ 1
#define _EVENTOUT_PC7_ 1
#define _EVENTOUT_PC8_ 1
#define _EVENTOUT_PC9_ 1
#define _EVENTOUT_PH0 _ 1
#define _EVENTOUT_PH1 _ 1

#define FMPI2C1_SCL_PA8_ PA8,GPIO_AF4
#define FMPI2C1_SCL_PB10_ PB10,GPIO_AF9
#define FMPI2C1_SCL_PB15_ PB15,GPIO_AF4
#define FMPI2C1_SCL_PC6_ PC6,GPIO_AF4
#define _FMPI2C1_SCL_PA8_ 1
#define _FMPI2C1_SCL_PB10_ 1
#define _FMPI2C1_SCL_PB15_ 1
#define _FMPI2C1_SCL_PC6_ 1

#define FMPI2C1_SDA_PB14_ PB14,GPIO_AF4
#define FMPI2C1_SDA_PB3_ PB3,GPIO_AF4
#define FMPI2C1_SDA_PC7_ PC7,GPIO_AF4
#define FMPI2C1_SDA_PC9_ PC9,GPIO_AF4
#define _FMPI2C1_SDA_PB14_ 1
#define _FMPI2C1_SDA_PB3_ 1
#define _FMPI2C1_SDA_PC7_ 1
#define _FMPI2C1_SDA_PC9_ 1

#define FMPI2C1_SMBA_PB13_ PB13,GPIO_AF4
#define FMPI2C1_SMBA_PC5_ PC5,GPIO_AF4
#define _FMPI2C1_SMBA_PB13_ 1
#define _FMPI2C1_SMBA_PC5_ 1

#define I2C1_SCL_PB6_ PB6,GPIO_AF4
#define I2C1_SCL_PB8_ PB8,GPIO_AF4
#define _I2C1_SCL_PB6_ 1
#define _I2C1_SCL_PB8_ 1

#define I2C1_SDA_PB7_ PB7,GPIO_AF4
#define I2C1_SDA_PB9_ PB9,GPIO_AF4
#define _I2C1_SDA_PB7_ 1
#define _I2C1_SDA_PB9_ 1

#define I2C1_SMBA_PB5_ PB5,GPIO_AF4
#define _I2C1_SMBA_PB5_ 1

#define I2C2_SCL_PB10_ PB10,GPIO_AF4
#define _I2C2_SCL_PB10_ 1

#define I2C2_SDA_PB11_ PB11,GPIO_AF4
#define I2C2_SDA_PB3_ PB3,GPIO_AF9
#define I2C2_SDA_PB9_ PB9,GPIO_AF9
#define _I2C2_SDA_PB11_ 1
#define _I2C2_SDA_PB3_ 1
#define _I2C2_SDA_PB9_ 1

#define I2C2_SMBA_PB12_ PB12,GPIO_AF4
#define _I2C2_SMBA_PB12_ 1

#define I2S1_CK_PA5_ PA5,GPIO_AF5
#define I2S1_CK_PB3_ PB3,GPIO_AF5
#define _I2S1_CK_PA5_ 1
#define _I2S1_CK_PB3_ 1

#define I2S1_MCK_PB10_ PB10,GPIO_AF6
#define I2S1_MCK_PC7_ PC7,GPIO_AF6
#define _I2S1_MCK_PB10_ 1
#define _I2S1_MCK_PC7_ 1

#define I2S1_SD_PA7_ PA7,GPIO_AF5
#define I2S1_SD_PB5_ PB5,GPIO_AF5
#define _I2S1_SD_PA7_ 1
#define _I2S1_SD_PB5_ 1

#define I2S1_WS_PA15_ PA15,GPIO_AF5
#define I2S1_WS_PA4_ PA4,GPIO_AF5
#define _I2S1_WS_PA15_ 1
#define _I2S1_WS_PA4_ 1

#define I2S2_CK_PB10_ PB10,GPIO_AF5
#define I2S2_CK_PB13_ PB13,GPIO_AF5
#define I2S2_CK_PC7_ PC7,GPIO_AF5
#define _I2S2_CK_PB10_ 1
#define _I2S2_CK_PB13_ 1
#define _I2S2_CK_PC7_ 1

#define I2S2_MCK_PA3_ PA3,GPIO_AF5
#define I2S2_MCK_PA6_ PA6,GPIO_AF6
#define I2S2_MCK_PC6_ PC6,GPIO_AF5
#define _I2S2_MCK_PA3_ 1
#define _I2S2_MCK_PA6_ 1
#define _I2S2_MCK_PC6_ 1

#define I2S2_SD_PB15_ PB15,GPIO_AF5
#define I2S2_SD_PC3_ PC3,GPIO_AF5
#define _I2S2_SD_PB15_ 1
#define _I2S2_SD_PC3_ 1

#define I2S2_WS_PB12_ PB12,GPIO_AF5
#define I2S2_WS_PB9_ PB9,GPIO_AF5
#define _I2S2_WS_PB12_ 1
#define _I2S2_WS_PB9_ 1

#define I2S5_CK_PB0_ PB0,GPIO_AF6
#define _I2S5_CK_PB0_ 1

#define I2S5_SD_PA10_ PA10,GPIO_AF6
#define I2S5_SD_PB8_ PB8,GPIO_AF6
#define _I2S5_SD_PA10_ 1
#define _I2S5_SD_PB8_ 1

#define I2S5_WS_PB1_ PB1,GPIO_AF6
#define _I2S5_WS_PB1_ 1

#define I2S_CKIN_PA2_ PA2,GPIO_AF5
#define I2S_CKIN_PB11_ PB11,GPIO_AF5
#define I2S_CKIN_PC9_ PC9,GPIO_AF5
#define _I2S_CKIN_PA2_ 1
#define _I2S_CKIN_PB11_ 1
#define _I2S_CKIN_PC9_ 1

#define LPTIM1_ETR_PB6_ PB6,GPIO_AF1
#define LPTIM1_ETR_PC3_ PC3,GPIO_AF1
#define _LPTIM1_ETR_PB6_ 1
#define _LPTIM1_ETR_PC3_ 1

#define LPTIM1_IN1_PB5_ PB5,GPIO_AF1
#define LPTIM1_IN1_PC0_ PC0,GPIO_AF1
#define _LPTIM1_IN1_PB5_ 1
#define _LPTIM1_IN1_PC0_ 1

#define LPTIM1_IN2_PB7_ PB7,GPIO_AF1
#define LPTIM1_IN2_PC2_ PC2,GPIO_AF1
#define _LPTIM1_IN2_PB7_ 1
#define _LPTIM1_IN2_PC2_ 1

#define LPTIM1_OUT_PB2_ PB2,GPIO_AF1
#define LPTIM1_OUT_PB8_ PB8,GPIO_AF1
#define LPTIM1_OUT_PC1_ PC1,GPIO_AF1
#define _LPTIM1_OUT_PB2_ 1
#define _LPTIM1_OUT_PB8_ 1
#define _LPTIM1_OUT_PC1_ 1

#define RCC_MCO_1_PA8_ PA8,GPIO_AF0
#define _RCC_MCO_1_PA8_ 1

#define RCC_MCO_2_PC9_ PC9,GPIO_AF0
#define _RCC_MCO_2_PC9_ 1

#define RTC_REFIN_PB15_ PB15,GPIO_AF0
#define _RTC_REFIN_PB15_ 1

#define SPI1_MISO_PA6_ PA6,GPIO_AF5
#define SPI1_MISO_PB4_ PB4,GPIO_AF5
#define _SPI1_MISO_PA6_ 1
#define _SPI1_MISO_PB4_ 1

#define SPI1_MOSI_PA7_ PA7,GPIO_AF5
#define SPI1_MOSI_PB5_ PB5,GPIO_AF5
#define _SPI1_MOSI_PA7_ 1
#define _SPI1_MOSI_PB5_ 1

#define SPI1_NSS_PA15_ PA15,GPIO_AF5
#define SPI1_NSS_PA4_ PA4,GPIO_AF5
#define _SPI1_NSS_PA15_ 1
#define _SPI1_NSS_PA4_ 1

#define SPI1_SCK_PA5_ PA5,GPIO_AF5
#define SPI1_SCK_PB3_ PB3,GPIO_AF5
#define _SPI1_SCK_PA5_ 1
#define _SPI1_SCK_PB3_ 1

#define SPI2_MISO_PB14_ PB14,GPIO_AF5
#define SPI2_MISO_PC2_ PC2,GPIO_AF5
#define _SPI2_MISO_PB14_ 1
#define _SPI2_MISO_PC2_ 1

#define SPI2_MOSI_PB15_ PB15,GPIO_AF5
#define SPI2_MOSI_PC3_ PC3,GPIO_AF5
#define _SPI2_MOSI_PB15_ 1
#define _SPI2_MOSI_PC3_ 1

#define SPI2_NSS_PB12_ PB12,GPIO_AF5
#define SPI2_NSS_PB9_ PB9,GPIO_AF5
#define _SPI2_NSS_PB12_ 1
#define _SPI2_NSS_PB9_ 1

#define SPI2_SCK_PB10_ PB10,GPIO_AF5
#define SPI2_SCK_PB13_ PB13,GPIO_AF5
#define SPI2_SCK_PC7_ PC7,GPIO_AF5
#define _SPI2_SCK_PB10_ 1
#define _SPI2_SCK_PB13_ 1
#define _SPI2_SCK_PC7_ 1

#define SPI5_MISO_PA12_ PA12,GPIO_AF6
#define _SPI5_MISO_PA12_ 1

#define SPI5_MOSI_PA10_ PA10,GPIO_AF6
#define SPI5_MOSI_PB8_ PB8,GPIO_AF6
#define _SPI5_MOSI_PA10_ 1
#define _SPI5_MOSI_PB8_ 1

#define SPI5_NSS_PB1_ PB1,GPIO_AF6
#define _SPI5_NSS_PB1_ 1

#define SPI5_SCK_PB0_ PB0,GPIO_AF6
#define _SPI5_SCK_PB0_ 1

#define SYS_JTCK_SWCLK_PA14_ PA14,GPIO_AF0
#define _SYS_JTCK_SWCLK_PA14_ 1

#define SYS_JTDI_PA15_ PA15,GPIO_AF0
#define _SYS_JTDI_PA15_ 1

#define SYS_JTDO_SWO_PB3_ PB3,GPIO_AF0
#define _SYS_JTDO_SWO_PB3_ 1

#define SYS_JTMS_SWDIO_PA13_ PA13,GPIO_AF0
#define _SYS_JTMS_SWDIO_PA13_ 1

#define SYS_JTRST_PB4_ PB4,GPIO_AF0
#define _SYS_JTRST_PB4_ 1

#define SYS_TRACECLK_PC6_ PC6,GPIO_AF0
#define _SYS_TRACECLK_PC6_ 1

#define SYS_TRACED0_PC10_ PC10,GPIO_AF0
#define _SYS_TRACED0_PC10_ 1

#define SYS_TRACED1_PC11_ PC11,GPIO_AF0
#define _SYS_TRACED1_PC11_ 1

#define SYS_TRACED2_PC12_ PC12,GPIO_AF0
#define _SYS_TRACED2_PC12_ 1

#define SYS_TRACED3_PB11_ PB11,GPIO_AF0
#define _SYS_TRACED3_PB11_ 1

#define TIM11_CH1_PB9_ PB9,GPIO_AF3
#define TIM11_CH1_PC12_ PC12,GPIO_AF3
#define _TIM11_CH1_PB9_ 1
#define _TIM11_CH1_PC12_ 1

#define TIM1_BKIN_PA6_ PA6,GPIO_AF1
#define TIM1_BKIN_PB12_ PB12,GPIO_AF1
#define _TIM1_BKIN_PA6_ 1
#define _TIM1_BKIN_PB12_ 1

#define TIM1_CH1_PA8_ PA8,GPIO_AF1
#define _TIM1_CH1_PA8_ 1

#define TIM1_CH1N_PA7_ PA7,GPIO_AF1
#define TIM1_CH1N_PB13_ PB13,GPIO_AF1
#define _TIM1_CH1N_PA7_ 1
#define _TIM1_CH1N_PB13_ 1

#define TIM1_CH2_PA9_ PA9,GPIO_AF1
#define _TIM1_CH2_PA9_ 1

#define TIM1_CH2N_PB0_ PB0,GPIO_AF1
#define TIM1_CH2N_PB14_ PB14,GPIO_AF1
#define _TIM1_CH2N_PB0_ 1
#define _TIM1_CH2N_PB14_ 1

#define TIM1_CH3_PA10_ PA10,GPIO_AF1
#define _TIM1_CH3_PA10_ 1

#define TIM1_CH3N_PB1_ PB1,GPIO_AF1
#define TIM1_CH3N_PB15_ PB15,GPIO_AF1
#define _TIM1_CH3N_PB1_ 1
#define _TIM1_CH3N_PB15_ 1

#define TIM1_CH4_PA11_ PA11,GPIO_AF1
#define _TIM1_CH4_PA11_ 1

#define TIM1_ETR_PA12_ PA12,GPIO_AF1
#define _TIM1_ETR_PA12_ 1

#define TIM5_CH1_PA0_ PA0,GPIO_AF2
#define TIM5_CH1_PB12_ PB12,GPIO_AF2
#define _TIM5_CH1_PA0_ 1
#define _TIM5_CH1_PB12_ 1

#define TIM5_CH2_PA1_ PA1,GPIO_AF2
#define TIM5_CH2_PC10_ PC10,GPIO_AF2
#define _TIM5_CH2_PA1_ 1
#define _TIM5_CH2_PC10_ 1

#define TIM5_CH3_PA2_ PA2,GPIO_AF2
#define TIM5_CH3_PC11_ PC11,GPIO_AF2
#define _TIM5_CH3_PA2_ 1
#define _TIM5_CH3_PC11_ 1

#define TIM5_CH4_PA3_ PA3,GPIO_AF2
#define TIM5_CH4_PB11_ PB11,GPIO_AF2
#define _TIM5_CH4_PA3_ 1
#define _TIM5_CH4_PB11_ 1

#define TIM9_CH1_PA2_ PA2,GPIO_AF3
#define TIM9_CH1_PC4_ PC4,GPIO_AF3
#define _TIM9_CH1_PA2_ 1
#define _TIM9_CH1_PC4_ 1

#define TIM9_CH2_PA3_ PA3,GPIO_AF3
#define TIM9_CH2_PC5_ PC5,GPIO_AF3
#define _TIM9_CH2_PA3_ 1
#define _TIM9_CH2_PC5_ 1

#define UART1_CK_PA8_ PA8,GPIO_AF7
#define _UART1_CK_PA8_ 1

#define UART1_CTS_PA11_ PA11,GPIO_AF7
#define _UART1_CTS_PA11_ 1

#define UART1_RTS_PA12_ PA12,GPIO_AF7
#define _UART1_RTS_PA12_ 1

#define UART1_RX_PA10_ PA10,GPIO_AF7
#define UART1_RX_PB3_ PB3,GPIO_AF7
#define UART1_RX_PB7_ PB7,GPIO_AF7
#define _UART1_RX_PA10_ 1
#define _UART1_RX_PB3_ 1
#define _UART1_RX_PB7_ 1

#define UART1_TX_PA15_ PA15,GPIO_AF7
#define UART1_TX_PA9_ PA9,GPIO_AF7
#define UART1_TX_PB6_ PB6,GPIO_AF7
#define _UART1_TX_PA15_ 1
#define _UART1_TX_PA9_ 1
#define _UART1_TX_PB6_ 1

#define UART2_CK_PA4_ PA4,GPIO_AF7
#define _UART2_CK_PA4_ 1

#define UART2_CTS_PA0_ PA0,GPIO_AF7
#define _UART2_CTS_PA0_ 1

#define UART2_RTS_PA1_ PA1,GPIO_AF7
#define _UART2_RTS_PA1_ 1

#define UART2_RX_PA3_ PA3,GPIO_AF7
#define _UART2_RX_PA3_ 1

#define UART2_TX_PA2_ PA2,GPIO_AF7
#define _UART2_TX_PA2_ 1

#define UART6_CK_PC8_ PC8,GPIO_AF8
#define _UART6_CK_PC8_ 1

#define UART6_RX_PA12_ PA12,GPIO_AF8
#define UART6_RX_PC7_ PC7,GPIO_AF8
#define _UART6_RX_PA12_ 1
#define _UART6_RX_PC7_ 1

#define UART6_TX_PA11_ PA11,GPIO_AF8
#define UART6_TX_PC6_ PC6,GPIO_AF8
#define _UART6_TX_PA11_ 1
#define _UART6_TX_PC6_ 1

#define USART1_CK_PA8_ PA8,GPIO_AF7
#define _USART1_CK_PA8_ 1

#define USART1_CTS_PA11_ PA11,GPIO_AF7
#define _USART1_CTS_PA11_ 1

#define USART1_RTS_PA12_ PA12,GPIO_AF7
#define _USART1_RTS_PA12_ 1

#define USART1_RX_PA10_ PA10,GPIO_AF7
#define USART1_RX_PB3_ PB3,GPIO_AF7
#define USART1_RX_PB7_ PB7,GPIO_AF7
#define _USART1_RX_PA10_ 1
#define _USART1_RX_PB3_ 1
#define _USART1_RX_PB7_ 1

#define USART1_TX_PA15_ PA15,GPIO_AF7
#define USART1_TX_PA9_ PA9,GPIO_AF7
#define USART1_TX_PB6_ PB6,GPIO_AF7
#define _USART1_TX_PA15_ 1
#define _USART1_TX_PA9_ 1
#define _USART1_TX_PB6_ 1

#define USART2_CK_PA4_ PA4,GPIO_AF7
#define _USART2_CK_PA4_ 1

#define USART2_CTS_PA0_ PA0,GPIO_AF7
#define _USART2_CTS_PA0_ 1

#define USART2_RTS_PA1_ PA1,GPIO_AF7
#define _USART2_RTS_PA1_ 1

#define USART2_RX_PA3_ PA3,GPIO_AF7
#define _USART2_RX_PA3_ 1

#define USART2_TX_PA2_ PA2,GPIO_AF7
#define _USART2_TX_PA2_ 1

#define USART6_CK_PC8_ PC8,GPIO_AF8
#define _USART6_CK_PC8_ 1

#define USART6_RX_PA12_ PA12,GPIO_AF8
#define USART6_RX_PC7_ PC7,GPIO_AF8
#define _USART6_RX_PA12_ 1
#define _USART6_RX_PC7_ 1

#define USART6_TX_PA11_ PA11,GPIO_AF8
#define USART6_TX_PC6_ PC6,GPIO_AF8
#define _USART6_TX_PA11_ 1
#define _USART6_TX_PC6_ 1

#endif /* LOWLEVEL_INCLUDE_DEVICE_ALTERNATE_FUNCTION */